In [1]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.3.3-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in e:\python\my_env\lib\site-packages (from pandas) (2.2.0)
Requirement already satisfied: python-dateutil>=2.8.2 in e:\python\my_env\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in e:\python\my_env\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.3-cp312-cp312-win_amd64.whl (11.0 MB)
   ---------------------------------------- 0.0/11.0 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.0 MB 1.4 MB/s eta 0:00:09
    --------------------------------------- 0.2/11.0 MB 2.0 MB/s eta 0:00:06
   - -------------------------------------- 0.5/11.0 MB 3.8 MB/s eta 0:00:03
   -- ------------------------------------- 0.7/11.0 MB 4.7 MB/s eta 0:00:03
   ---- ----------------------------------- 1.1/11.0 MB 5.5 MB/s eta 0:00:02
   ------ --------------------------------- 1.7/11.0 MB 6.7 MB/s eta 0:00:02
   ---------- ----------------------------- 2.8/11.0 MB 9.4 MB/s eta 0:00:01
   -------------- ------------------------- 4.0/11.0 MB 11.7 MB/s eta 0:00:01
   ------------------- -------------------- 5.2/11.0 MB 14.0 MB/s eta 0:00:01
   --------------------- ------------------ 6.0/11.0 MB 14.2 MB/s eta 0:00:01
   --------------------------- ------------ 7.5/11.0 MB 15.9 MB/s eta 0:00:01
   ------------------------------- -------- 8.6/11.0 MB 17.2 MB/s eta 0:00:01
   ----------------------------------- ---- 9.7/11.0 MB 17.6 MB/s eta 0:00:01
   ------------------------------------ --- 9.9/11.0 MB 16.7 MB/s eta 0:00:01
   ---------------------------------------  11.0/11.0 MB 22.6 MB/s eta 0:00:01
   ---------------------------------------  11.0/11.0 MB 22.6 MB/s eta 0:00:01
   ---------------------------------------- 11.0/11.0 MB 19.3 MB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
   ---------------------------------------- 0.0/509.2 kB ? eta -:--:--
   --------------------------------------- 509.2/509.2 kB 16.1 MB/s eta 0:00:00
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
   ---------------------------------------- 0.0/347.8 kB ? eta -:--:--
   --------------------------------------- 347.8/347.8 kB 21.1 MB/s eta 0:00:00
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.3.3 pytz-2025.2 tzdata-2025.2

[notice] A new release of pip is available: 24.0 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

In [5]:
# Series
data = [1, 2, 3, 4, 5]
series = pd.Series(data)
print("Series:\n", series)

Series:
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
# Create a Series form Dictionary
data_dict = {'a': 10, 'b': 20, 'c': 30}
series_dict = pd.Series(data_dict)
print("Series from Dictionary:\n", series_dict)

Series from Dictionary:
 a    10
b    20
c    30
dtype: int64

In [8]:
data = [10,20,30,40,50]
index = ['a','b','c','d','e']
series_custom_index = pd.Series(data, index=index)
print("Series with Custom Index:\n", series_custom_index)

Series with Custom Index:
 a    10
b    20
c    30
d    40
e    50
dtype: int64

In [9]:
# DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
print("DataFrame:\n", df)

DataFrame:
       Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [10]:
import numpy as np
np.array(df)

array([['Alice', 25, 'New York'],
       ['Bob', 30, 'Los Angeles'],
       ['Charlie', 35, 'Chicago']], dtype=object)

In [11]:
# Create a DataFrame from a list of dictionaries
data_list_dict = [
    {'Name': 'Alice', 'Age': 25, 'City': 'New York'},
    {'Name': 'Bob', 'Age': 30, 'City': 'Los Angeles'},
    {'Name': 'Charlie', 'Age': 35, 'City': 'Chicago'}]
df_list_dict = pd.DataFrame(data_list_dict)
print("DataFrame from List of Dictionaries:\n", df_list_dict)

DataFrame from List of Dictionaries:
       Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [12]:
df = pd.read_csv('sales_data.csv')

In [13]:
df.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [14]:
df.tail()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [16]:
# Accessing Columns
df.loc[0]

Transaction ID              10001
Date                   2024-01-01
Product Category      Electronics
Product Name        iPhone 14 Pro
Units Sold                      2
Unit Price                 999.99
Total Revenue             1999.98
Region              North America
Payment Method        Credit Card
Name: 0, dtype: object

In [17]:
df_list_dict['Name']

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [19]:
df.iloc[0]

Transaction ID              10001
Date                   2024-01-01
Product Category      Electronics
Product Name        iPhone 14 Pro
Units Sold                      2
Unit Price                 999.99
Total Revenue             1999.98
Region              North America
Payment Method        Credit Card
Name: 0, dtype: object

In [20]:
df_list_dict.iloc[0]

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [21]:
df.at[0, 'Region']

'North America'

In [22]:
df = df_list_dict

In [23]:
df['Salary'] = [70000, 80000, 90000]
df

      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago   90000

In [24]:
# Remove a column
df.drop('Salary', axis=1, inplace=True)
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [25]:
# Add Age to the columns
df['Age'] = df['Age'] + 5
df

      Name  Age         City
0    Alice   30     New York
1      Bob   35  Los Angeles
2  Charlie   40      Chicago

In [26]:
df.drop(0)

      Name  Age         City
1      Bob   35  Los Angeles
2  Charlie   40      Chicago

In [27]:
df

      Name  Age         City
0    Alice   30     New York
1      Bob   35  Los Angeles
2  Charlie   40      Chicago

In [28]:
df.dtypes

Name    object
Age      int64
City    object
dtype: object

In [30]:
df.describe()

        Age
count   3.0
mean   35.0
std     5.0
min    30.0
25%    32.5
50%    35.0
75%    37.5
max    40.0